src/DataProcessors/НачальныйЭкран/НачальныйЭкран.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НачальныйЭкран</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/Баланс/Баланс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Баланс</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счета</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидОперацииДокумента/ВидОперацииДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииДокумента</name>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Счета</name>
  <predefined>
    <items>
      <name>БанковскийСчет</name>
      <description>Банковский счет</description>
    </items>
    <items>
      <name>Карта</name>
      <description>Карта</description>
    </items>
    <items>
      <name>Кошелек</name>
      <description>Кошелек</description>
    </items>
  </predefined>
  <attributes>
    <name>Баланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидСчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/НачальныйЭкран/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Если ЗначениеЗаполнено(ВалютаУчета) Тогда	
		Элементы.Декорация2.Заголовок = ВалютаУчета;
		Элементы.Декорация4.Заголовок = ВалютаУчета;
	КонецЕсли;
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.ИзменитьРазмерШрифтаЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	//Расходы
	СформироватьДанныеПоРасходамДоходам("Расходы", "ГруппаДанныеРасходовЛево", "ГруппаДанныеРасходовПраво");
	
	//Доходы
	СформироватьДанныеПоРасходамДоходам("Доходы", "ГруппаДанныеДоходовЛево", "ГруппаДанныеДоходовПраво");
	
	//Счета
	СформироватьСписокСчетов();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеПоРасходамДоходам(ВидОперации, ИмяГруппаЛево, ИмяГруппаПраво)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса(ВидОперации);
	УстановитьПараметрыЗапроса(Запрос);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Для n=1 По 3 Цикл
				Если n = 1 Тогда
					ИмяПериода = "Сегодня";
					Сумма = Выборка.Сегодня;
				ИначеЕсли n = 2 Тогда
					ИмяПериода = "Неделя";
					Сумма = Выборка.Неделя;
				ИначеЕсли n = 3 Тогда
					ИмяПериода = "Месяц";
					Сумма = Выборка.Месяц;
				КонецЕсли;
				
				Если Сумма = NULL ИЛИ Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				//Вывести группу
				//ОбщийМодульСервер.ДобавитьГруппуНаФорму(ЭтотОбъект, "Группа" + ВидОперации + ИмяПериода, ИмяПериода, "Группа" + ВидОперации);
				//Вывести надпись
				//ОбщийМодульСервер.ДобавитьДекорациюНаФорму(ЭтотОбъект, "Декорация" + ВидОперации + ИмяПериода, ИмяПериода, "Группа" + ВидОперации + ИмяПериода, Ложь, Истина);
				//Вывести сумму
				//ОбщийМодульСервер.ДобавитьДекорациюНаФорму(ЭтотОбъект, "Декорация" + ВидОперации + ИмяПериода + "Сумма", Строка(Сумма), "Группа" + ВидОперации + ИмяПериода, Ложь, Ложь);
				//Вывести надпись
				ОбщийМодульСервер.ДобавитьДекорациюНаФорму(ЭтотОбъект, "Декорация" + ВидОперации + ИмяПериода, ИмяПериода, ИмяГруппаЛево, Ложь, Истина);
				//Вывести сумму
				ОбщийМодульСервер.ДобавитьДекорациюНаФорму(ЭтотОбъект, "Декорация" + ВидОперации + ИмяПериода + "Сумма", Строка(Сумма), ИмяГруппаПраво, Ложь, Ложь);
								
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокСчетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Кошелек.Наименование КАК Счет,
				   |	Кошелек.ВидСчета КАК ВидСчета, 
	               |	БалансОстатки.Валюта КАК Валюта,
	               |	БалансОстатки.СуммаОстаток КАК Сумма
	               |ИЗ
	               |	Справочник.Счета КАК Кошелек
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Баланс.Остатки(&Период, ) КАК БалансОстатки
	               |		ПО (БалансОстатки.Счета = Кошелек.Ссылка)";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаименованиеСчета = СтрЗаменить(Выборка.Счет, " ", "");
		
		//Вывести группу
		ОбщийМодульСервер.ДобавитьГруппуНаФорму(ЭтотОбъект, "Группа" + НаименованиеСчета, Выборка.Счет, "ГруппаСчета");
		//Вывести картинку декорации
		ОбщийМодульСервер.ДобавитьКартинкуСчетаДекорации(ЭтотОбъект, "ДекорацияКартинка" + НаименованиеСчета, "Группа" + НаименованиеСчета, Выборка.ВидСчета);
		//Вывести надпись
		ОбщийМодульСервер.ДобавитьДекорациюНаФорму(ЭтотОбъект, "Декорация" + НаименованиеСчета, Выборка.Счет, "Группа" + НаименованиеСчета, Ложь, Истина);
		//Вывести сумму
		ОбщийМодульСервер.ДобавитьДекорациюНаФорму(ЭтотОбъект, "Декорация" + НаименованиеСчета + "Сумма", Строка(Выборка.Сумма), "Группа" + НаименованиеСчета, Ложь, Ложь);
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса(ИмяРегистра)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СУММА(РасходыОбороты.СуммаОборот) КАК Сегодня
	               |ПОМЕСТИТЬ ВТ_Сегодня
	               |ИЗ
	               |	РегистрНакопления."+ИмяРегистра+".Обороты(&НачалоДня, &КонецДня, , Валюта = &Валюта) КАК РасходыОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыОбороты.СуммаОборот) КАК Неделя
	               |ПОМЕСТИТЬ ВТ_Неделя
	               |ИЗ
	               |	РегистрНакопления."+ИмяРегистра+".Обороты(&НачалоНедели, &КонецНедели, , Валюта = &Валюта) КАК РасходыОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыОбороты.СуммаОборот) КАК Месяц
	               |ПОМЕСТИТЬ ВТ_Месяц
	               |ИЗ
	               |	РегистрНакопления."+ИмяРегистра+".Обороты(&НачалоМесяца, &КонецМесяца, , Валюта = &Валюта) КАК РасходыОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Месяц.Месяц КАК Месяц,
	               |	ВТ_Неделя.Неделя КАК Неделя,
	               |	ВТ_Сегодня.Сегодня КАК Сегодня
	               |ИЗ
	               |	ВТ_Сегодня КАК ВТ_Сегодня
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Неделя КАК ВТ_Неделя
	               |		ПО (ИСТИНА)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Месяц КАК ВТ_Месяц
	               |		ПО (ИСТИНА)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыЗапроса(Запрос)
	
	Запрос.УстановитьПараметр("НачалоДня", 		НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецДня", 		КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачалоНедели", 	НачалоНедели(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецНедели", 	КонецНедели(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачалоМесяца", 	НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецМесяца", 	КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Валюта", 		ВалютаУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРасход(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыДокумента", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ОбщаяФормаДокумента", Новый Структура("ВидОперации", ПолучитьВидОперации("Расход")),ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоход(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыДокумента", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ОбщаяФормаДокумента", Новый Структура("ВидОперации", ПолучитьВидОперации("Приход")),ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыДокумента(Результат, ПараметрыРезультата)Экспорт
	
	ПодготовитьФормуНаСервере();
	
	ОбщийМодульКлиент.ИзменитьРазмерШрифтаЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка = Ложь)
	
	Если НЕ СтрНайти(Элемент.Подсказка, "Команда") Тогда
		ИмяРегистра = ?(СтрНайти(Элемент.Подсказка, "Расходы"), "Расходы", "Доходы");
		Период = СтрЗаменить(Элемент.Подсказка, ИмяРегистра, "");
		
		Если Период = "Сегодня" Тогда
			НачалоПериода 	= НачалоДня(ТекущаяДата());
			КонецПериода 	= КонецДня(ТекущаяДата());
		ИначеЕсли Период = "Неделя" Тогда
			НачалоПериода 	= НачалоНедели(ТекущаяДата());
			КонецПериода 	= КонецНедели(ТекущаяДата());
		ИначеЕсли Период = "Месяц" Тогда
			НачалоПериода 	= НачалоМесяца(ТекущаяДата());
			КонецПериода 	= КонецМесяца(ТекущаяДата());
		КонецЕсли;
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("НачалоПериода", НачалоПериода);
		ПараметрыОтчета.Вставить("КонецПериода", КонецПериода);
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		
		Если ИмяРегистра = "Расходы" Тогда
			ОткрытьФорму("Отчет.ОтчетПоРасходам.Форма", ПараметрыОтчета);
		Иначе
			ОткрытьФорму("Отчет.ОтчетПоДоходам.Форма", ПараметрыОтчета);
		КонецЕсли;
	Иначе
		ИмяСчета = СтрЗаменить(Элемент.Подсказка, "Команда", "");
		Счет = НайтиСчетПоНаименованию(ИмяСчета);
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыОтчета.Вставить("Счет", Счет);
		ПараметрыОтчета.Вставить("НачалоПериода", НачалоДня(ТекущаяДата()));
		ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ТекущаяДата()));
		
		ОткрытьФорму("Отчет.ОтчетПоВзаиморасчетам.Форма.ФормаОтчета", ПараметрыОтчета);
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиСчетПоНаименованию(ИмяСчета)
	
	Возврат Справочники.Счета.НайтиПоНаименованию(ИмяСчета);
	
КонецФункции

&НаКлиенте
Процедура ДекорацияСписокОтчетовНажатие(Элемент)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОтчеты;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетРасходы(Команда)
	ОткрытьФорму("Отчет.ОтчетПоРасходам.Форма",);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетПоДоходам(Команда)
	ОткрытьФорму("Отчет.ОтчетПоДоходам.Форма",);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяНаОсновнуюСтраницу(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОсновная;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетПоВзаиморасчетам(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВоспроизвестиМузыку(Команда)
	
	ИмяМелодии = ВоспроизвестиМузыкуВозврат();
	
	#Если МобильноеПриложениеКлиент Тогда
		 СредстваМультимедиа.ВоспроизвестиАудио(ИмяМелодии,,,Истина);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВоспроизвестиМузыкуНажатие(Элемент)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаМедиаПлеер;
КонецПроцедуры

&НаСервере
Функция ВоспроизвестиМузыкуВозврат()
	
	Возврат ОбщийМодульСервер.ПолучитьИмяЗвуковогоФайла("РингтонЗвонка");
	
КонецФункции

&НаСервере
Функция ПолучитьВидОперации(ВидОперации)
	Возврат Перечисления.ВидОперацииДокумента[ВидОперации];	
КонецФункции
